app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 187]]
---
  def show
    @song = Song.find(params[:id])

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-05-15 00:39:01.652834"], ["updated_at", "2018-05-15 00:39:01.652834"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-05-15 00:39:01.681659"], ["updated_at", "2018-05-15 00:39:01.681659"]]
---
  def upload
    CSV.foreach(params[:files].path, headers: true) do |file|
      a = Artist.find_or_create_by(name: file[1])
      Song.find_or_create_by(title: file[0], artist: a)